---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FailureDefinition Properties
FailureDefinition Class See Also Send Feedback
---

The FailureDefinition type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Severity | The severity of the failure. |

# See Also

FailureDefinition Class

Autodesk.Revit.DB Namespace